/**
 * 
 */
package com.akb48plus.common;

/**
 * @author QuSheng
 *
 */
public class Const {
    
    public static String PREF_AKB_LIST_NAME = "AKB_MEMBER_LIST";
    public static String PREF_SKE_LIST_NAME = "SKE_MEMBER_LIST";
    public static String PREF_NMB_LIST_NAME = "NMB_MEMBER_LIST";
    public static String PREF_HKT_LIST_NAME = "HKT_MEMBER_LIST";
    
    public static long MAX_ACTIVITIES = 100;
    
    public static final String ATTACH_TYPE_PHOTO = "photo";
    public static final String ATTACH_TYPE_VIDEO = "video";
    public static final String ATTACH_TYPE_ARTICLE = "article";
    
    public static final String ACTIVITY_VERB_POST = "post";
    public static final String ACTIVITY_VERB_SHARE = "share";
    
    public static final int PHOTO_SIZE = 400;

    /**
     * Google+ IDs of AKB48 members. Lasted updated on 2012/1/26.
     * @see http://www.google.com/intl/ja/+/project48/
     */
    public static String DEFAULT_AKB_MEMBER_LIST[][] = {
        {
        // Staff
        "106126936082110026164",   // 石川太郎    Official    Staff
        "113474433041552257864",   // 秋元康    Official    Staff
        "103388469578205010447",   // 戸賀崎智信    Official    Staff
        "103959130721189812017",   // 湯浅洋    Official    Staff
        "103350333579457321452",   // 金子剛    Official    Staff
        "117905992285697890829",   // 佐藤和也    Official    Staff
        "112435502021367429566",   // 茅野しのぶ    Official    Staff
        "108897254135232129896",   // 井上ヨシマサ    Official    Staff
        "115719063745850111024",   // 大澤剛    Official    Staff
    
        // AKB48
        "114038303885145553998",   // 岩佐美咲    AKB48    team A
        "115743581016964883134",   // 多田愛佳    AKB48    team A
        "108367535733172853340",   // 大家志津香    AKB48    team A
        "108485060451296256117",   // 片山陽加    AKB48    team A
        "103787924613525409143",   // 倉持明日香    AKB48    team A
        "114739367195523292316",   // 小嶋陽菜    AKB48    team A
        "104375100134443203420",   // 指原莉乃    AKB48    team A
        "105312608513060875034",   // 篠田麻里子    AKB48    team A
        "107954758685270685108",   // 高城亜樹    AKB48    team A
        "116816132092699657436",   // 高橋みなみ    AKB48    team A
        "102249965218267255722",   // 仲川遥香    AKB48    team A
        "106819068054122298292",   // 中田ちさと    AKB48    team A
        "117151902078571783647",   // 仲谷明香    AKB48    team A
        "116582420246242769167",   // 前田敦子    AKB48    team A
        "113029702385411102951",   // 前田亜美    AKB48    team A
        "110106903212386059477",   // 松原夏海    AKB48    team A
        "105020230123170728064",   // 秋元才加    AKB48    team K
        "108406705498777962659",   // 板野友美    AKB48    team K
        "105842454176256413407",   // 内田眞由美    AKB48    team K
        "112077362806147944184",   // 梅田彩佳    AKB48    team K
        "105229500895781124316",   // 大島優子    AKB48    team K
        "102861211420357915358",   // 菊地あやか    AKB48    team K
        "115449512138863581856",   // 田名部生来    AKB48    team K
        "106902079329146402543",   // 中塚智実    AKB48    team K
        "106541618903520668641",   // 仁藤萌乃    AKB48    team K
        "101031357714890657558",   // 野中美郷    AKB48    team K
        "109052751022632539844",   // 藤江れいな    AKB48    team K
        "111700319553120354024",   // 松井咲子    AKB48    team K
        "113175170244847276511",   // 峯岸みなみ    AKB48    team K
        "111186383073996701022",   // 宮澤佐江    AKB48    team K
        "109380179669644031316",   // 横山由依    AKB48    team K
        //"110841113220926588945",   // 米沢瑠美    AKB48    team K
        "101026469701528255144",   // 石田晴香    AKB48    team B
        "110230842586402039931",   // 河西智美    AKB48    team B
        "109547251260290757268",   // 柏木由紀    AKB48    team B
        "114392080665434978357",   // 北原里英    AKB48    team B
        "111171583195412578810",   // 小林香菜    AKB48    team B
        "107000363532428575751",   // 小森美果    AKB48    team B
        "108623251197634437138",   // 佐藤亜美菜    AKB48    team B
        "112309691086068535265",   // 佐藤すみれ    AKB48    team B
        "102181587900817571440",   // 佐藤夏希    AKB48    team B
        "117847838306056282869",   // 鈴木紫帆里    AKB48    team B
        "109273326082502819549",   // 鈴木まりや    AKB48    team B
        "103259286719163415846",   // 近野莉菜    AKB48    team B
        //"117480374878682152542",   // 平嶋夏海    AKB48    team B
        "116563387779051485156",   // 増田有華    AKB48    team B
        "105599945949824406376",   // 宮崎美穂    AKB48    team B
        "111886243683596094429",   // 渡辺麻友    AKB48    team B
        "100694627368957691223",   // 阿部マリア    AKB48    team 4
        "101763044621259372363",   // 市川美織    AKB48    team 4
        "101748015513264110691",   // 入山杏奈    AKB48    team 4
        "110216234612751595989",   // 大場美奈    AKB48    team 4
        "109793323492513330070",   // 島崎遥香    AKB48    team 4
        "102844391735210836268",   // 島田晴香    AKB48    team 4
        "102440721186115061522",   // 竹内美宥    AKB48    team 4
        "115842256718368316968",   // 仲俣汐里    AKB48    team 4
        "100757137373116382078",   // 中村麻里子    AKB48    team 4
        "107953103521320651388",   // 永尾まりや    AKB48    team 4
        "101637952441360556747",   // 山内鈴蘭    AKB48    team 4
        "108246279762026812099",   // 伊豆田莉奈    AKB48    研究生
        "104469157599705660710",   // 岩田華怜    AKB48    研究生
        "104832409151547328144",   // 大森美優    AKB48    研究生
        "112984877710421269938",   // 加藤玲奈    AKB48    研究生
        "106346370911183711893",   // 川栄李奈    AKB48    研究生
        "115154079096419739247",   // 小嶋菜月    AKB48    研究生
        "111438309227794971277",   // 小林茉里奈    AKB48    研究生
        "111810846135180115151",   // サイード横田絵玲奈    AKB48    研究生
        "105835152133357364264",   // 佐々木優佳里    AKB48    研究生
        "104794906427493486303",   // 鈴木里香    AKB48    研究生
        "107910364578005352567",   // 高橋朱里    AKB48    研究生
        "115940285904755808895",   // 田野優花    AKB48    研究生
        "101666520014328843283",   // 名取稚菜    AKB48    研究生
        "102663035987142737445",   // 平田梨奈    AKB48    研究生
        "100063943132747828422",   // 藤田奈那    AKB48    研究生
        "100987694249056428673",   // 武藤十夢    AKB48    研究生
        "101238058961311557814",   // 森川彩香    AKB48    研究生
        // Staff Team
        "117147321771860727748", // AKB48
        },
        {
            "石川太郎",
            "秋元康",
            "戸賀崎智信",
            "湯浅洋",
            "金子剛",
            "佐藤和也",
            "茅野しのぶ",
            "井上ヨシマサ",
            "大澤剛",
            "岩佐美咲",
            "多田愛佳",
            "大家志津香",
            "片山陽加",
            "倉持明日香",
            "小嶋陽菜",
            "指原莉乃",
            "篠田麻里子",
            "高城亜樹",
            "高橋みなみ",
            "仲川遥香",
            "中田ちさと",
            "仲谷明香",
            "前田敦子",
            "前田亜美",
            "松原夏海",
            "秋元才加",
            "板野友美",
            "内田眞由美",
            "梅田彩佳",
            "大島優子",
            "菊地あやか",
            "田名部生来",
            "中塚智実",
            "仁藤萌乃",
            "野中美郷",
            "藤江れいな",
            "松井咲子",
            "峯岸みなみ",
            "宮澤佐江",
            "横山由依",
            //"米沢瑠美",
            "石田晴香",
            "河西智美",
            "柏木由紀",
            "北原里英",
            "小林香菜",
            "小森美果",
            "佐藤亜美菜",
            "佐藤すみれ",
            "佐藤夏希",
            "鈴木紫帆里",
            "鈴木まりや",
            "近野莉菜",
           // "平嶋夏海",
            "増田有華",
            "宮崎美穂",
            "渡辺麻友",
            "阿部マリア",
            "市川美織",
            "入山杏奈",
            "大場美奈",
            "島崎遥香",
            "島田晴香",
            "竹内美宥",
            "仲俣汐里",
            "中村麻里子",
            "永尾まりや",
            "山内鈴蘭",
            "伊豆田莉奈",
            "岩田華怜",
            "大森美優",
            "加藤玲奈",
            "川栄李奈",
            "小嶋菜月",
            "小林茉里奈",
            "サイード横田絵玲奈",
            "佐々木優佳里",
            "鈴木里香",
            "高橋朱里",
            "田野優花",
            "名取稚菜",
            "平田梨奈",
            "藤田奈那",
            "武藤十夢",
            "森川彩香",
            "AKB48"
        }
    };

    /**
     * Google+ IDs of SKE48 members. Lasted updated on 2012/1/26.
     * @see http://www.google.com/intl/ja/+/project48/
     */
    public static String DEFAULT_SKE_MEMBER_LIST[][] = {
        {
            // SKE48
            "116324240483798147615",   // 大矢真那    SKE48    team S
            "111145641865855965824",   // 小野晴香    SKE48    team S
            "107674992218008076992",   // 加藤るみ    SKE48    team S
            "111001986183198441065",   // 木﨑ゆりあ    SKE48    team S
            "117533056464814306425",   // 木下有希子    SKE48    team S
            "100200160956657706975",   // 桑原みずき    SKE48    team S
            "115975634910643785199",   // 須田亜香里    SKE48    team S
            "112166094088653039891",   // 高田志織    SKE48    team S
            "101713591556895969107",   // 出口陽    SKE48    team S
            "107061289389523750061",   // 中西優香    SKE48    team S
            "100593468647281401358",   // 平田璃香子    SKE48    team S
            "111254737005235237589",   // 平松可奈子    SKE48    team S
            "102372344957102189329",   // 松井珠理奈    SKE48    team S
            "108536765591006886419",   // 松井玲奈    SKE48    team S
            "109140442575159610384",   // 矢神久美    SKE48    team S
            "110780930132548888998",   // 赤枝里々奈    SKE48    team KII
            "102764447672444416615",   // 阿比留李帆    SKE48    team KII
            "116252784914637564000",   // 石田安奈    SKE48    team KII
            "107135851528812577523",   // 小木曽汐莉    SKE48    team KII
            "108340808318911923001",   // 加藤智子    SKE48    team KII
            "104341148263550771546",   // 後藤理沙子    SKE48    team KII
            "112980138521977900424",   // 佐藤聖羅    SKE48    team KII
            "114397630658650917209",   // 佐藤実絵子    SKE48    team KII
            "106926723626971174827",   // 高柳明音    SKE48    team KII
            "108037953963364967101",   // 秦佐和子    SKE48    team KII
            "111050677534976069347",   // 古川愛李    SKE48    team KII
            "111792731544936626652",   // 松本梨奈    SKE48    team KII
            "117122356051025200492",   // 向田茉夏    SKE48    team KII
            "102565671074822095382",   // 矢方美紀    SKE48    team KII
            "108734175672740889367",   // 山田澪花    SKE48    team KII
            "101584503735010828799",   // 若林倫香    SKE48    team KII
            "110547918216387313519",   // 磯原杏華    SKE48    team E
            "117516762830406649713",   // 上野圭澄    SKE48    team E
            "118425778047788093453",   // 梅本まどか    SKE48    team E
            "117433562651585228733",   // 金子栞    SKE48    team E
            "118292013193988155683",   // 木本花音    SKE48    team E
            "103904242672756284899",   // 小林亜実    SKE48    team E
            "115313835371482911514",   // 酒井萌衣    SKE48    team E
            "113499890803474188597",   // 柴田阿弥    SKE48    team E
            "100806834975375116663",   // 高木由麻奈    SKE48    team E
            "111253632744203791499",   // 竹内舞    SKE48    team E
            "103713218956069883516",   // 都築里佳    SKE48    team E
            "105328900551339818980",   // 原望奈美    SKE48    team E
            "117214005905987253541",   // 間野春香    SKE48    team E
            "110525631600509252689",   // 山下ゆかり    SKE48    team E
            "110018085870094502593",   // 山田恵里伽    SKE48    team E
            "101027924315502812552",   // 井口栞里    SKE48    研究生
            "115730192449019105814",   // 犬塚あさな    SKE48    研究生
            "106656898590733509216",   // 今出舞    SKE48    研究生
            "114117235562724035328",   // 内山命    SKE48    研究生
            "102982862918484502371",   // 鬼頭桃菜    SKE48    研究生
            "105739481850011872539",   // 小林絵未梨    SKE48    研究生
            "114693866568676269449",   // 斉藤真木子    SKE48    研究生
            "108705263081706477178",   // 松村香織    SKE48    研究生
            "104424976615287976283",   // 水埜帆乃香    SKE48    研究生
            // Staff Team
            "116751037770394303220", // SKE48
        },
        {
            "大矢真那",
            "小野晴香",
            "加藤るみ",
            "木﨑ゆりあ",
            "木下有希子",
            "桑原みずき",
            "須田亜香里",
            "高田志織",
            "出口陽",
            "中西優香",
            "平田璃香子",
            "平松可奈子",
            "松井珠理奈",
            "松井玲奈",
            "矢神久美",
            "赤枝里々奈",
            "阿比留李帆",
            "石田安奈",
            "小木曽汐莉",
            "加藤智子",
            "後藤理沙子",
            "佐藤聖羅",
            "佐藤実絵子",
            "高柳明音",
            "秦佐和子",
            "古川愛李",
            "松本梨奈",
            "向田茉夏",
            "矢方美紀",
            "山田澪花",
            "若林倫香",
            "磯原杏華",
            "上野圭澄",
            "梅本まどか",
            "金子栞",
            "木本花音",
            "小林亜実",
            "酒井萌衣",
            "柴田阿弥",
            "高木由麻奈",
            "竹内舞",
            "都築里佳",
            "原望奈美",
            "間野春香",
            "山下ゆかり",
            "山田恵里伽",
            "井口栞里",
            "犬塚あさな",
            "今出舞",
            "内山命",
            "鬼頭桃菜",
            "小林絵未梨",
            "斉藤真木子",
            "松村香織",
            "水埜帆乃香",
            "SKE48"
        }
    };
    
    /**
     * Google+ IDs of NMB48 members. Lasted updated on 2012/1/26.
     * @see http://www.google.com/intl/ja/+/project48/
     */
    public static String DEFAULT_NMB_MEMBER_LIST[][] = {
        {
            // NMB48
            "116080183063480282368", // 小笠原茉由 NMB48 team N
            "116852193162190904300", // 門脇佳奈子 NMB48 team N
            "107756318055823246187", // 岸野里香 NMB48 team N
            "111726993387349262398", // 木下春奈 NMB48 team N
            "100694839033896673847", // 小谷里歩 NMB48 team N
            "108121336346623963998", // 近藤里奈 NMB48 team N
            "107456237173689373341", // 篠原栞那 NMB48 team N
            "103948509378248185139", // 白間美瑠 NMB48 team N
            "113516536547276113860", // 上西恵 NMB48 team N
            "101854092637878212405", // 福本愛菜 NMB48 team N
            "109310472381413281309", // 松田栞 NMB48 team N
            "103663030781390958288", // 山口夕輝 NMB48 team N
            "102277090985412703374", // 山田菜々 NMB48 team N
            "101423472932208115437", // 山本彩 NMB48 team N
            "108862052279750773861", // 吉田朱里 NMB48 team N
            "109544372058574620997", // 渡辺美優紀 NMB48 team N
            "104540799121659392739", // 太田里織菜 NMB48 team M
            "113548903943701827498", // 川上礼奈 NMB48 team M
            "110219169108613831999", // 木下百花 NMB48 team M
            "117896186544129616545", // 小鷹狩佑香 NMB48 team M
            "106176150979443047095", // 島田玲奈 NMB48 team M
            "109638186060118072119", // 城恵理子 NMB48 team M
            "114488817218493827050", // 高野祐衣 NMB48 team M
            "100515188323145163173", // 谷川愛梨 NMB48 team M
            "101092011169016421448", // 肥川彩愛 NMB48 team M
            "118370370953021367600", // 藤田留奈 NMB48 team M
            "108841554434587390767", // 三田麻央 NMB48 team M
            "117655629637021320261", // 村上文香 NMB48 team M
            "114433951972746099923", // 村瀬紗英 NMB48 team M
            "110515811233847190239", // 矢倉楓子 NMB48 team M
            "111183489254439809555", // 山岸奈津美 NMB48 team M
            "109057690948151627836", // 東由樹 NMB48 研究生
            "115765743928146295934", // 石田優美 NMB48 研究生
            "111167834152662625124", // 鵜野みずき NMB48 研究生
            "102859549141435220113", // 岡田梨紗子 NMB48 研究生
            "104529234818538128511", // 沖田彩華 NMB48 研究生
            "108341666924993077629", // 古賀成美 NMB48 研究生
            "111118114050350393642", // 小柳有沙 NMB48 研究生
            "104846917278979290942", // 佐藤天彩 NMB48 研究生
            "102839473765308016371", // 中川紘美 NMB48 研究生
            "105975378768005691666", // 林萌々香 NMB48 研究生
            "116999436633946440277", // 原みづき NMB48 研究生
            "110228651304968689682", // 山本ひとみ NMB48 研究生
            
            // Staff Team
            "104432502432473755826" // NMB48
        },
        {
            "小笠原茉由",
            "門脇佳奈子",
            "岸野里香",
            "木下春奈",
            "小谷里歩",
            "近藤里奈",
            "篠原栞那",
            "白間美瑠",
            "上西恵",
            "福本愛菜",
            "松田栞",
            "山口夕輝",
            "山田菜々",
            "山本彩",
            "吉田朱里",
            "渡辺美優紀",
            "太田里織菜",
            "川上礼奈",
            "木下百花",
            "小鷹狩佑香",
            "島田玲奈",
            "城恵理子",
            "高野祐衣",
            "谷川愛梨",
            "肥川彩愛",
            "藤田留奈",
            "三田麻央",
            "村上文香",
            "村瀬紗英",
            "矢倉楓子",
            "山岸奈津美",
            "東由樹",
            "石田優美",
            "鵜野みずき",
            "岡田梨紗子",
            "沖田彩華",
            "古賀成美",
            "小柳有沙",
            "佐藤天彩",
            "中川紘美",
            "林萌々香",
            "原みづき",
            "山本ひとみ",
            "NMB48"
        }
    };

    /**
     * Google+ IDs of NMB48 members. Lasted updated on 2012/1/26.
     * @see http://www.google.com/intl/ja/+/project48/
     */
    public static String DEFAULT_HKT_MEMBER_LIST[][] = {
        {
            // HKT48
            "106102390858541443310",// 穴井千尋 HKT48 team H
            "107850647144188324652",// 植木南央 HKT48 team H
            "112809008708989184267",// 熊沢世莉奈 HKT48 team H
            "111907069956262615426",// 兒玉遥 HKT48 team H
            "117429983367030282830",// 古森結衣 HKT48 team H
            "111363964900769496942",// 下野由貴 HKT48 team H
            "104137648731435726318",// 菅本裕子 HKT48 team H
            "105015705151101532017",// 中西智代梨 HKT48 team H
            "107241677527739013868",// 松岡菜摘 HKT48 team H
            "102808008463301583196",// 宮脇咲良 HKT48 team H
            "115608229387461419797",// 村重杏奈 HKT48 team H
            "104185663412698594190",// 本村碧唯 HKT48 team H
            "107858117023519021548",// 森保まどか HKT48 team H
            "108592604171173727989",// 若田部遥 HKT48 team H
            "109229124597499008502",// 安陪恭加 HKT48 研究生
            "102120909316124491120",// 今田美奈 HKT48 研究生
            "116819083606243987960",// 江藤彩也香 HKT48 研究生
            "106837344952867534542",// 仲西彩佳 HKT48 研究生
            
            // Staff Team
            "102988890725022311407" // HKT48
        },
        {
            "穴井千尋",
            "植木南央",
            "熊沢世莉奈",
            "兒玉遥",
            "古森結衣",
            "下野由貴",
            "菅本裕子",
            "中西智代梨",
            "松岡菜摘",
            "宮脇咲良",
            "村重杏奈",
            "本村碧唯",
            "森保まどか",
            "若田部遥",
            "安陪恭加",
            "今田美奈",
            "江藤彩也香",
            "仲西彩佳",
            "HKT48"
        }
    };
}
