/**
 * 
 */
package com.akb48plus.common;

/**
 * @author QuSheng
 *
 */
public class Const {
    
    public static String PREF_AKB_LIST_NAME = "AKB_MEMBER_LIST";
    public static String PREF_SKE_LIST_NAME = "SKE_MEMBER_LIST";
    public static String PREF_NMB_LIST_NAME = "NMB_MEMBER_LIST";
    public static String PREF_HKT_LIST_NAME = "HKT_MEMBER_LIST";
    
    public static long MAX_ACTIVITIES = 100;
    
    public static final String ATTACH_TYPE_PHOTO = "photo";
    public static final String ATTACH_TYPE_VIDEO = "video";
    public static final String ATTACH_TYPE_ARTICLE = "article";
    
    public static final String ACTIVITY_VERB_POST = "post";
    public static final String ACTIVITY_VERB_SHARE = "share";
    
    public static final int PHOTO_SIZE = 400;

    /**
     * Google+ IDs of AKB48 members. Lasted updated on 2012/1/26.
     * @see http://www.google.com/intl/ja/+/project48/
     */
    public static String DEFAULT_AKB_MEMBER_LIST[] = {
        

            
            // Staff
            "113474433041552257864", // 秋元康
            "103388469578205010447", // 戸賀崎智信
            
            // AKB48
//            "105020230123170728064", // 秋元才加
//            "101026469701528255144", // 石田晴香
//            "108406705498777962659", // 板野友美
//            "105842454176256413407", // 内田眞由美
//            "112077362806147944184", // 梅田彩佳
//            "105229500895781124316", // 大島優子
//            "110216234612751595989", // 大場美奈
//            "108367535733172853340", // 大家志津香
//            "110230842586402039931", // 河西智美
//            "109547251260290757268", // 柏木由紀
//            "108485060451296256117", // 片山陽加
//            "102861211420357915358", // 菊地あやか
//            "114392080665434978357", // 北原里英
//            "103787924613525409143", // 倉持明日香
//            "114739367195523292316", // 小嶋陽菜
//            "111171583195412578810", // 小林香菜
//            "104375100134443203420", // 指原莉乃
//            "108623251197634437138", // 佐藤亜美菜
//            "112309691086068535265", // 佐藤すみれ
//            "102181587900817571440", // 佐藤夏希
//            "105312608513060875034", // 篠田麻里子
//            "102844391735210836268", // 島田晴香
//            "109273326082502819549", // 鈴木まりや
//            "107954758685270685108", // 高城亜樹
//            "116816132092699657436", // 高橋みなみ
//            "115449512138863581856", // 田名部生来
//            "103259286719163415846", // 近野莉菜
//            "102249965218267255722", // 仲川遥香
//            "106819068054122298292", // 中田ちさと
//            "106902079329146402543", // 中塚智実
//            "100757137373116382078", // 中村麻里子
//            "115842256718368316968", // 仲俣汐里
//            "117151902078571783647", // 仲谷明香
//            "106541618903520668641", // 仁藤萌乃
//            "101031357714890657558", // 野中美郷
//            "117480374878682152542", // 平嶋夏海
//            "116582420246242769167", // 前田敦子
//            "116563387779051485156", // 増田有華
//            "111700319553120354024", // 松井咲子
//            "110106903212386059477", // 松原夏海
//            "113175170244847276511", // 峯岸みなみ
//            "105599945949824406376", // 宮崎美穂
//            "111186383073996701022", // 宮澤佐江
//            "109380179669644031316", // 横山由依
//            "110841113220926588945", // 米沢瑠美
            
            // Staff Team
            "117147321771860727748", // AKB48
           // "106758056094193397775" // AKB48 部屋っ子
    };

    /**
     * Google+ IDs of SKE48 members. Lasted updated on 2012/1/26.
     * @see http://www.google.com/intl/ja/+/project48/
     */
    public static String DEFAULT_SKE_MEMBER_LIST[] = {

        
        // SKE48
        "102764447672444416615", // 阿比留李帆
        "106656898590733509216", // 今出舞
        "118425778047788093453", // 梅本まどか
        "116324240483798147615", // 大矢真那
        "107135851528812577523", // 小木曽汐莉
        "111145641865855965824", // 小野晴香
        "108340808318911923001", // 加藤智子
        "102982862918484502371", // 鬼頭桃菜
        "117533056464814306425", // 木下有希子
        "100200160956657706975", // 桑原みずき
        "103904242672756284899", // 小林亜実
        "112980138521977900424", // 佐藤聖羅
        "114397630658650917209", // 佐藤実絵子
        "113499890803474188597", // 柴田阿弥
        "115975634910643785199", // 須田亜香里
        "100806834975375116663", // 高木由麻奈
        "112166094088653039891", // 高田志織
        "106926723626971174827", // 高柳明音
        "111253632744203791499", // 竹内舞
        "101713591556895969107", // 出口陽
        "107061289389523750061", // 中西優香
        "108037953963364967101", // 秦佐和子
        "100593468647281401358", // 平田璃香子
        "111254737005235237589", // 平松可奈子
        "111050677534976069347", // 古川愛李
        "108536765591006886419", // 松井玲奈
        "108705263081706477178", // 松村香織
        "111792731544936626652", // 松本梨奈
        "102565671074822095382", // 矢方美紀
        
        // Staff Team
        "116751037770394303220", // SKE48
        //"101064661667017020038" // SKE48 部屋っ子
    };
    
    /**
     * Google+ IDs of NMB48 members. Lasted updated on 2012/1/26.
     * @see http://www.google.com/intl/ja/+/project48/
     */
    public static String DEFAULT_NMB_MEMBER_LIST[] = {

        
        // NMB48
        "106176150979443047095", // 島田玲奈
        "114488817218493827050", // 高野祐衣
        "101854092637878212405", // 福本愛菜
        "117655629637021320261", // 村上文香
        "103663030781390958288", // 山口夕輝
        "102277090985412703374", // 山田菜々
        "101423472932208115437", // 山本彩
        "109544372058574620997", // 渡辺美優紀
        
        // Staff Team
        "104432502432473755826", // NMB48
        //"112063625278289697769" // NMB48 部屋っ子
        
    };

    /**
     * Google+ IDs of NMB48 members. Lasted updated on 2012/1/26.
     * @see http://www.google.com/intl/ja/+/project48/
     */
    public static String DEFAULT_HKT_MEMBER_LIST[] = {
        // Staff Team
        "102988890725022311407", // HKT48
        "111799140715858863784" // HKT48 部屋っ子
        // HKT48

    };
}
